// File: heap_sort.go
// Created Time: 2023-05-29
// Author: Reanon (793584285@qq.com)

package chapter_sorting

/* Длина кучи равна n; начиная с узла i, выполнить просеивание сверху вниз */
func siftDown(nums *[]int, n, i int) {
	for true {
		// Определить узел с максимальным значением среди i, l и r и обозначить его как ma
		l := 2*i + 1
		r := 2*i + 2
		ma := i
		if l < n && (*nums)[l] > (*nums)[ma] {
			ma = l
		}
		if r < n && (*nums)[r] > (*nums)[ma] {
			ma = r
		}
		// Если узел i уже максимален или индексы l и r вне границ, дальнейшее просеивание не требуется, выйти
		if ma == i {
			break
		}
		// Поменять два узла местами
		(*nums)[i], (*nums)[ma] = (*nums)[ma], (*nums)[i]
		// Циклическое просеивание вниз
		i = ma
	}
}

/* Сортировка кучей */
func heapSort(nums *[]int) {
	// Построение кучи: выполнить heapify для всех узлов, кроме листовых
	for i := len(*nums)/2 - 1; i >= 0; i-- {
		siftDown(nums, len(*nums), i)
	}
	// Извлекать максимальный элемент из кучи в течение n-1 итераций
	for i := len(*nums) - 1; i > 0; i-- {
		// Поменять корневой узел с самым правым листом местами (поменять первый и последний элементы)
		(*nums)[0], (*nums)[i] = (*nums)[i], (*nums)[0]
		// Начиная с корневого узла, выполнить просеивание сверху вниз
		siftDown(nums, i, 0)
	}
}
